Documents/РешениеОПриемеНаРаботу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>РешениеОПриемеНаРаботу</Name>
			<BasedOn>
				<xr:Item>Catalog.Кандидаты</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПланОбученияСотрудников</xr:Item>
				<xr:Item>InformationRegister.ОбновлениеЗаданийАдаптацииУвольнения</xr:Item>
				<xr:Item>InformationRegister.МероприятияАдаптацииУвольненияПоДокументу</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кандидат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кандидаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьПоШтатномуРасписанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоваяПозиция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрофильДолжности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофилиДолжностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапланироватьПрограммуОбучения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспытательныйСрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласованныйДоход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДистанционнаяРабота</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОплатыТруда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОплатыТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Территория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТерриторииВыполненияРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛичныеДанныеКандидата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛичныеДанныеКандидатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МероприятияАдаптацииУвольнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Мероприятие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МероприятияАдаптацииУвольнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Comment>Плановый срок исполнения задачи</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрограммаОбучения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Мероприятие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МероприятияОбученияРазвития</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУчебныхЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>8</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРасходов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВариантыОплатыТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВариантыОплатыТруда</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФОТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласованныйДоход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияСогласования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассматривается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийПроцентСевернойНадбавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтудентРаботающийВСтудотряде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьНаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/РешениеОПриемеНаРаботу/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьПраваНаПроведение(Отказ, РежимЗаписи, РежимПроведения);
	ПроверитьЛичныеДанныеКандидата();
	ПроверитьФизическоеЛицо(РежимЗаписи);
	
	ЗаполнитьПрежниеДанные();

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	АдаптацияУвольнение.ПриЗаписи(ЭтотОбъект, Отказ);

	ОбновитьСотрудника();

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ДатаПриема = ТекущаяДатаСеанса();
	ВариантОплатыТруда = Перечисления.ВариантыОплатыТруда.СогласованныйДоход;
	ЗаполнитьПоДаннымКандидата(ДанныеЗаполнения, СтандартнаяОбработка);
	ЗаполнитьПоДаннымЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ДанныеДляПроведения = ДанныеДляПроведения();
	
	АдаптацияУвольнение.СформироватьДвиженияМероприятияАдаптацииУвольненияПоДокументу(Движения,
		ДанныеДляПроведения.ДанныеМероприятийАдаптацииУвольнения);
	АдаптацияУвольнение.ЗарегистрироватьДокументДляОбновленияЗаданийАдаптацииУвольнения(Движения);
	
	Если ЗапланироватьПрограммуОбучения Тогда
		ОбучениеРазвитие.СформироватьДвиженияПланаПоСотрудникам(Движения,
			ДанныеДляПроведения.ПлановыеДвиженияСотрудников);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, ДатаПриема, "Объект.ДатаПриема", Отказ, НСтр("ru = 'Дата приема'"),
		, , Ложь);
	
	АдаптацияУвольнение.ПроверитьЗаполнениеМероприятийАдаптацииВРешенииОПриеме(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	Если Не Отказ Тогда
		КадровыеРешения.ПроверитьНаличиеДубляДокумента(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	ОбучениеРазвитие.ПроверитьЗаполнениеПрограммыОбученияВРешенииОПриеме(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	
	Если НоваяПозиция Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ДолжностьПоШтатномуРасписанию");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	АдаптацияУвольнение.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеДляПроведения() Экспорт
	
	ФизическоеЛицо = ДополнительныеСвойства.ФизическоеЛицо;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) КАК Сотрудник,
	|	Мероприятия.Мероприятие,
	|	Мероприятия.ДатаНачала,
	|	Мероприятия.ДатаОкончания,
	|	Мероприятия.Исполнитель
	|ИЗ
	|	Документ.РешениеОПриемеНаРаботу.МероприятияАдаптацииУвольнения КАК Мероприятия
	|ГДЕ
	|	Мероприятия.Ссылка = &Ссылка";
		
	ДанныеМероприятий = Запрос.Выполнить().Выгрузить();
	
	ДанныеМероприятий.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ДанныеМероприятий.ЗаполнитьЗначения(ФизическоеЛицо, "ФизическоеЛицо");
	
	ДанныеМероприятий.Колонки.Добавить("ДокументОснование", Новый ОписаниеТипов(
		Метаданные.ОпределяемыеТипы.СобытияАдаптацииУвольнения.Тип));
	ДанныеМероприятий.ЗаполнитьЗначения(Ссылка, "ДокументОснование");
	
	ДанныеДляПроведения = Новый Структура;
	ДанныеДляПроведения.Вставить("ДанныеМероприятийАдаптацииУвольнения", ДанныеМероприятий);
	ДанныеДляПроведения.Вставить("ПлановыеДвиженияСотрудников",
		ДанныеДляПроведенияПланОбученияСотрудников(ФизическоеЛицо));
	
	Возврат ДанныеДляПроведения;
	
КонецФункции

Функция ДанныеДляПроведенияПланОбученияСотрудников(ФизическоеЛицо)
	
	Если Не ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	&Подразделение КАК Подразделение,
		|	РешениеОПриемеНаРаботуПрограммаОбучения.Мероприятие КАК Мероприятие,
		|	РешениеОПриемеНаРаботуПрограммаОбучения.ДатаНачала КАК ДатаНачала,
		|	РешениеОПриемеНаРаботуПрограммаОбучения.ДатаОкончания КАК ДатаОкончания,
		|	РешениеОПриемеНаРаботуПрограммаОбучения.Ответственный КАК Ответственный,
		|	РешениеОПриемеНаРаботуПрограммаОбучения.КоличествоУчебныхЧасов КАК КоличествоУчебныхЧасов,
		|	РешениеОПриемеНаРаботуПрограммаОбучения.СуммаРасходов КАК СуммаРасходов
		|ИЗ
		|	Документ.РешениеОПриемеНаРаботу.ПрограммаОбучения КАК РешениеОПриемеНаРаботуПрограммаОбучения
		|ГДЕ
		|	РешениеОПриемеНаРаботуПрограммаОбучения.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Подразделение",
		ОрганизационнаяСтруктура.МестоПозицииВСтруктуреПредприятия(ДолжностьПоШтатномуРасписанию));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	ТаблицаРезультат.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТаблицаРезультат.ЗаполнитьЗначения(ФизическоеЛицо, "ФизическоеЛицо");
	
	Возврат ТаблицаРезультат;

КонецФункции

Процедура ПроверитьПраваНаПроведение(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не ПравоДоступа("Добавление", Метаданные.Документы.РешениеОПриемеНаРаботу)  Тогда
		
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение И Не Проведен Тогда
			Отказ = Истина;
			ВызватьИсключение(НСтр("ru = 'Нет прав на проведение непроведенного документа.'"));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЛичныеДанныеКандидата()

	Если Не ЗначениеЗаполнено(ЛичныеДанныеКандидата) И ЗначениеЗаполнено(Кандидат) Тогда
		ЛичныеДанныеКандидата = Справочники.Кандидаты.ДанныеКандидата(Кандидат).ЛичныеДанныеКандидата;
		ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(ЛичныеДанныеКандидата),
			СтрШаблон(НСтр("ru = 'Для кандидата %1 не найдены личные данные.'"), Кандидат));
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьФизическоеЛицо(РежимЗаписи)
	
	Если РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;

	ФизическоеЛицо = Документы.РешениеОПриемеНаРаботу.НайтиФизическоеЛицо(Ссылка, Кандидат);
	
	ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(ФизическоеЛицо),
		СтрШаблон(НСтр("ru = 'Для кандидата %1 не найдено физическое лицо.'"), Кандидат));
		
	ДополнительныеСвойства.Вставить("ФизическоеЛицо", ФизическоеЛицо);
		
КонецПроцедуры

Процедура ЗаполнитьПоДаннымЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если ДанныеЗаполнения.Свойство("Кандидат") Тогда
		ЗаполнитьПоДаннымКандидата(ДанныеЗаполнения.Кандидат, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры
	
Процедура ЗаполнитьПоДаннымКандидата(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("СправочникСсылка.Кандидаты") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеКандидата = Справочники.Кандидаты.ДанныеКандидата(ДанныеЗаполнения);
	Если ДанныеКандидата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеКандидата.Состояние <> Перечисления.СостоянияСогласования.Согласовано Тогда
		ВызватьИсключение НСтр("ru = 'Кандидат не утвержден. 
                                |Решение о приеме на работу вводится для утвержденных (одобренных) кандидатов.'");
	КонецЕсли;
	
	ПараметрыДанных = Справочники.Вакансии.ПараметрыПолученияДанныхВакансии();
	ПараметрыДанных.Согласование = Истина;
	
	ДанныеВакансии = Справочники.Вакансии.ДанныеВакансии(ДанныеКандидата.Вакансия, ПараметрыДанных);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСогласованиеВакансий") Тогда
		Если Не ЗначениеЗаполнено(ДанныеКандидата.Вакансия) Тогда
			ВызватьИсключение НСтр("ru = 'Вакансия не заполнена. 
	                                |Решение о приеме на работу вводится для кандидата на согласованную вакансию.'");
		КонецЕсли;
		Если ДанныеВакансии.Согласование = Неопределено 
			Или ДанныеВакансии.Согласование.СостояниеСогласования <> Перечисления.СостоянияСогласования.Согласовано Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Вакансия %1 не согласована. 
	                  |Решение о приеме на работу вводится для кандидата на согласованную вакансию.'"),
				ДанныеКандидата.Вакансия);
			ВызватьИсключение ТекстСообщения;
		КонецЕсли;
	КонецЕсли;
	
	Кандидат = ДанныеКандидата.Кандидат;
	ЛичныеДанныеКандидата = ДанныеКандидата.ЛичныеДанныеКандидата;
	Подразделение = ДанныеВакансии.Подразделение;
	Должность = ДанныеВакансии.Должность;
	ПрофильДолжности = ДанныеВакансии.ПрофильДолжности;
	НоваяПозиция = ДанныеВакансии.НоваяПозиция;
	РабочееМесто = ДанныеВакансии.РабочееМесто;
	ИспытательныйСрок = ДанныеВакансии.ИспытательныйСрок;
	
	СуммаВВалютеПоУмолчанию = ПодборПерсоналаКлиентСервер.СуммаВВалютеПоУмолчанию(
		ДанныеКандидата.ОжидаемыйДоход, ДанныеКандидата.ВалютаДохода);
	СогласованныйДоход = ПодборПерсоналаКлиентСервер.ОжидаемыйДоходВМесяц(
		СуммаВВалютеПоУмолчанию, ДанныеКандидата.ПериодичностьДохода);
	
	Если Не ДанныеВакансии.НоваяПозиция Тогда
		ДолжностьПоШтатномуРасписанию = ДанныеВакансии.Позиция;
		ДанныеПозиции = Справочники.ШтатноеРасписание.ДанныеПозицииШтатногоРасписания(ДанныеВакансии.Позиция);
		Организация = ДанныеПозиции.Организация;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПрежниеДанные()
	
	Если ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	ПрежниеДанные = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, 
		"ПрежниеДанные", Новый Структура);

	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Кандидат, Проведен");
	ПрежниеДанные.Вставить("Кандидат", ЗначенияРеквизитов.Кандидат);
	ПрежниеДанные.Вставить("Проведен", ЗначенияРеквизитов.Проведен);

	ДополнительныеСвойства.Вставить("ПрежниеДанные", ПрежниеДанные);
	
КонецПроцедуры

Процедура ОбновитьСотрудника()

	ПрежниеДанные = СвойствоСтруктуры(ДополнительныеСвойства, "ПрежниеДанные", Новый Структура());
	
	Если СвойствоСтруктуры(ПрежниеДанные, "Кандидат") = Кандидат 
		И СвойствоСтруктуры(ПрежниеДанные, "Проведен", Ложь) = Проведен Тогда
		Возврат;
	КонецЕсли;

	ПрежнийСотрудник = Неопределено;
	Если СвойствоСтруктуры(ПрежниеДанные, "Проведен", Ложь) Тогда
		УстановитьПривилегированныйРежим(Истина);
		ПрежнийСотрудник = Документы.РешениеОПриемеНаРаботу.СотрудникПоРешениюОПриемеНаРаботу(Ссылка);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;

	Если Не Проведен Тогда
		ОтвязатьСотрудника(ПрежнийСотрудник);
		Возврат;
	КонецЕсли;

	Если СвойствоСтруктуры(ПрежниеДанные, "Кандидат") <> Кандидат Тогда
		ОтвязатьСотрудника(ПрежнийСотрудник);
	КонецЕсли;

	СведенияОСотруднике = СвойствоСтруктуры(ДополнительныеСвойства, "СведенияОСотруднике", Новый Структура());
	
	// Из формы пользователь выбрал существующего сотрудника.
	ПривязатьСотрудника(СвойствоСтруктуры(СведенияОСотруднике, "Сотрудник"), 
		СвойствоСтруктуры(СведенияОСотруднике, "ПриказОПриеме"));

КонецПроцедуры

Процедура ПривязатьСотрудника(Сотрудник, ПриказОПриеме)

	УстановитьПривилегированныйРежим(Истина);
	
	Если Сотрудник = Неопределено Тогда
		// Новый сотрудник
		ФизическоеЛицо = Справочники.Кандидаты.ФизическоеЛицоКандидата(Кандидат);
		ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(ФизическоеЛицо), 
			НСтр("ru = 'Физическое лицо не обнаружено, проведение документа невозможно'"), 
			Метаданные.Документы.РешениеОПриемеНаРаботу.ПолноеИмя());
		Сотрудник = КадровыйУчет.НовыйСотрудникФизическогоЛица(ФизическоеЛицо, Организация);
	КонецЕсли;

	Документы.РешениеОПриемеНаРаботу.СвязатьСотрудникаСРешениемОПриемеНаРаботу(Ссылка, Сотрудник);
	Если ПриказОПриеме <> Неопределено Тогда
		ПриказОбъект = ПриказОПриеме.ПолучитьОбъект();
		ПриказОбъект.Решение = Ссылка;
		ПриказОбъект.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтвязатьСотрудника(Сотрудник)

	Если Сотрудник = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ДанныеСотрудника = КадровыйУчет.КадровыеДанныеСотрудника(Ложь, 
		Сотрудник, "ДатаНачалаУчета, ВАрхиве", ТекущаяДатаСеанса());
	УстановитьПривилегированныйРежим(Ложь);
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		Сотрудник = Неопределено Или Не ЗначениеЗаполнено(ДанныеСотрудника.ДатаНачалаУчета), 
		СтрШаблон(НСтр("ru = 'С документом связан сотрудник %1, по которому зарегистрированы трудовые отношения. 
			 |Операции с решением о приеме на работу более и невозможны, и не имеют смысла.'"), Сотрудник));

	УстановитьПривилегированныйРежим(Истина);
	КадровыйУчет.ПоместитьСотрудникаВАрхив(Сотрудник, Истина);
	Документы.РешениеОПриемеНаРаботу.ОтвязатьСотрудникаОтРешенияОПриемеНаРаботу(Ссылка);
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Функция СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено)
	Возврат ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию);
КонецФункции

#Область ОбменДанными

Функция СовместноРегистрируемыеОбъекты() Экспорт
	Возврат ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Кандидат);
КонецФункции

#КонецОбласти

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
